## Import packages

In [4]:
import psycopg2 as pg2
import pandas as pd
import getpass

## Connect to database

In [5]:
secret = getpass.getpass('Enter your PostgreSQL password')

Enter your PostgreSQL password········

In [18]:
conn = pg2.connect(database='dvdrental', user='postgres' ,password=secret)

In [19]:
cur = conn.cursor()

## Execute query, store as data, and close conn

In [24]:
actors_table = "SELECT * FROM actor"
actors_first_name = "SELECT first_name FROM actor"

In [25]:
cur.execute(actors_first_name)

In [26]:
# fetchall()
# fetchmany(10)
# fetchone()
data = cur.fetchone()

In [27]:
data

('Penelope',)

### Close connection

In [11]:
# you'll need to run the conn cell to open a new connection
conn.close()

### BONUS: Create a pandas DataFrame

In [15]:
df = pd.DataFrame(data)

In [16]:
df

       0         1             2                       3
0      1  Penelope       Guiness 2013-05-26 14:47:57.620
1      2      Nick      Wahlberg 2013-05-26 14:47:57.620
2      3        Ed         Chase 2013-05-26 14:47:57.620
3      4  Jennifer         Davis 2013-05-26 14:47:57.620
4      5    Johnny  Lollobrigida 2013-05-26 14:47:57.620
..   ...       ...           ...                     ...
195  196      Bela        Walken 2013-05-26 14:47:57.620
196  197     Reese          West 2013-05-26 14:47:57.620
197  198      Mary        Keitel 2013-05-26 14:47:57.620
198  199     Julia       Fawcett 2013-05-26 14:47:57.620
199  200     Thora        Temple 2013-05-26 14:47:57.620

[200 rows x 4 columns]

### Add columns names and drop duplicate index

In [50]:
new_df = df.set_axis(['index','first_name', 'last_name','last_update'], axis=1)

In [52]:
new_df = new_df.drop(['index'], axis=1)

In [53]:
new_df

    first_name     last_name             last_update
0     Penelope       Guiness 2013-05-26 14:47:57.620
1         Nick      Wahlberg 2013-05-26 14:47:57.620
2           Ed         Chase 2013-05-26 14:47:57.620
3     Jennifer         Davis 2013-05-26 14:47:57.620
4       Johnny  Lollobrigida 2013-05-26 14:47:57.620
..         ...           ...                     ...
195       Bela        Walken 2013-05-26 14:47:57.620
196      Reese          West 2013-05-26 14:47:57.620
197       Mary        Keitel 2013-05-26 14:47:57.620
198      Julia       Fawcett 2013-05-26 14:47:57.620
199      Thora        Temple 2013-05-26 14:47:57.620

[200 rows x 3 columns]